In [114]:
import os
import pandas as pd

BASE_DIR = '.'
DATA_DIR = os.path.join(BASE_DIR, 'dados')

In [115]:
base = pd.read_csv(os.path.join(DATA_DIR, 'base.csv'), sep=';', decimal= ',')
base.columns

Index(['Nº Registro', 'Sexo', 'Data Admissão_Mês', 'Data Admissão_Ano',
       'Data Nascito. Titular_Mês', 'Data Nascito. Titular_Ano',
       'Salário ano 1', 'Data Nascito. Cônjuge_Mês',
       'Data Nascito. Cônjuge_Ano', 'Data Nascito.Filho A_Mês',
       'Data Nascito.Filho A_Ano', 'Data Nascito.Filho B_Mês',
       'Data Nascito.Filho B_Ano', 'Data Nascito. Filho C_Mês',
       'Data Nascito. Filho C_Ano', 'idade_titular', 'idade_conjuge',
       'idade_filho_A', 'idade_filho_B', 'idade_filho_C', 'salário ano 2',
       'classe', 'numero de dependentes', 'conjuge', 'filho A', 'filho B',
       'filho C', 'qnt. Filhos', 'menor que 14'],
      dtype='object')

In [116]:
dados.dtypes

Nº Registro                   int64
Sexo                         object
Data Admissão_Mês             int64
Data Admissão_Ano             int64
Data Nascito. Titular_Mês     int64
Data Nascito. Titular_Ano     int64
Salário ano 1                object
Data Nascito. Cônjuge_Mês     int64
Data Nascito. Cônjuge_Ano     int64
Data Nascito.Filho A_Mês      int64
Data Nascito.Filho A_Ano      int64
Data Nascito.Filho B_Mês      int64
Data Nascito.Filho B_Ano      int64
Data Nascito. Filho C_Mês     int64
Data Nascito. Filho C_Ano     int64
Idade titular                 int64
idade_conjuge                 int64
idade_filho_A                 int64
idade_filho_B                 int64
idade_filho_C                 int64
salário ano 2                object
classe                       object
numero de dependentes         int64
conjuge                      object
filho A                       int64
filho B                       int64
filho C                       int64
qnt. Filhos                   int64
menor que 14                  int64
Tempo de Serviço              int64
dtype: object

In [117]:
ativos = base.pivot_table(index = 'idade_titular',
                 values = ['Nº Registro', 'Salário ano 1'],
                 aggfunc=['count', 'mean'])
ativos.columns = ativos.columns.droplevel()
ativos.columns = ['n',1,2,'salario_medio']
ativos=ativos.drop(columns=[1,2])
ativos

                 n  salario_medio
idade_titular
20               9    4240.354444
21              13    3744.349231
22              16    5296.860000
23              15    5006.819333
24              25    4701.286800
25              26    5105.320385
26              34    5645.776765
27              23    3388.201304
28              36    5264.736389
29              46    5200.735000
30              54    4520.154444
31              68    5049.806618
32              65    5224.667385
33              76    4909.489079
34              82    5119.474634
35             105    6015.995524
36             105    6196.279048
37             101    5332.653267
38             105    5355.118476
39             129    6737.861705
40              97    7318.200515
41             102    6138.039706
42              97    7226.320825
43              95    6608.628105
44              74    7636.648514
45              66    6766.920758
46              78    6700.072179
47              73    7331.257671
48              56    6589.032143
49              59    8376.412373
50              40    7738.210750
51              43    8082.737442
52              41    6540.175610
53              29    6482.178276
54              33    6376.345152
55              25    6301.859600
56              25    5126.893200
57              17    9235.551176
58              13    4660.374615
59               9    4846.922222
60              11    3660.890000
61              11    5587.400909
62              15    4456.642667
63               4    4083.100000
64               8    6523.290000
65               4    6723.360000
66               5    5601.458000
67               2   10126.930000
68               1    4816.210000